export const PersonalLogs = [
  {
    publishTime: '2023-10-23 21:17:00',
    content: `记录下今天的学习进度：
1. 系统学习下 nestjs 的 SwaggerUI 章节；
2. 观看科大《计算机网络》课程，emm...夯实基础还是有点必要；\n
3. 准备在自己的 meleon-profile 项目里写个任务管理的功能，把学到的 nest 知识实践一遍。
4. 给 ml-drawer 添加展示页面，本来想加个弹出动画，但是效果一般，后续看看其他组件库的源码有没有更好的方案
    `,
    imageNums: 2
  },
  {
    publishTime: '2023-10-24 23:10:00',
    content: `记录下今天的学习进度：
  1. 调整原先的任务管理模块的页面布局，添加“创建任务”功能前端布局及基本逻辑，初步确定后端数据的存储结构及逻辑；
  2. 继续观看科大《计算机网络》课程，坚持一天一节课吧，一个多小时有点熬人，正好书到了，结合着学习；
  3. ml-drawer 的基本功能也写好了，后续写实际功能的时候边写边完善。接下来准备投入到 ml-table 组件的开发，先把之前用原生微信写的代码整到目前这个项目来；
  4. 每天的算法题也要坚持刷，考虑下要不要改成早上刷题，晚上脑子有点跟不上了，害...
      `,
    imageNums: 3
  }
]
